# **SQL METHODS**

In SQL, methods refer to functions or procedures that perform specific tasks within your queries. They are like pre-defined tools that you can use to manipulate, analyze, or interact with your data in various ways.

#### **Import SQLite3**

In [2]:
import sqlite3

#### **Connect to the SQLite Database**
If you want to create the database file in the current directory (where your Jupyter Notebook is located) and specify the name of the database file, you can do it like this:

In [3]:
conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

### **SELECT**

The SELECT statement in SQL retrieves data from one or more tables, allowing users to specify columns to fetch and apply filters, sorting, and aggregations to manipulate the data returned.

In [4]:
cursor.execute("SELECT * FROM employees")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3, None),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None)]

### **DISTINCT**

The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate rows are removed from the output.

In [5]:
cursor.execute("SELECT DISTINCT department FROM employees")
cursor.fetchall()

[('Marketing',), ('Sales',), ('Operations',), ('IT',), ('Finance',), ('HR',)]

In [6]:
# If you have a tuple that contains one element, add a comma at the end
number = (1,)
print(number)
print(type(number))

(1,)
<class 'tuple'>

### **LIMIT**

The **LIMIT** clause specifies the maximum number of rows to return in a query result.

In [7]:
cursor.execute("""
SELECT * FROM employees
               LIMIT 5
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None)]

In [8]:
# LIMIT starting offset, how many records to display
cursor.execute("""
SELECT * FROM employees
               LIMIT 3, 5
""")
cursor.fetchall()

[(5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None)]

### **COUNT**

The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

In [20]:
cursor.execute("SELECT COUNT(*) FROM employees")
cursor.fetchall()

[(29,)]

In [10]:
cursor.execute("SELECT COUNT(DISTINCT department) FROM employees")
cursor.fetchall()

[(6,)]

### **WHERE**

The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.

### **Comparison Operators:**
#### `=`: Equal to

In [11]:
cursor.execute("""
SELECT * FROM employees WHERE department = 'IT';
""")
cursor.fetchall()

[(6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None)]

#### `!=` : Not equal to

In [12]:
cursor.execute("""
SELECT * FROM employees WHERE department != 'IT';
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3, None),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None)]

#### `<` : Less than

In [19]:
cursor.execute("""
SELECT * FROM employees WHERE performance_rating < 3;""")
cursor.fetchall()

[(4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None)]

#### `>` : Greater than

In [15]:
cursor.execute("""
SELECT * FROM employees WHERE performance_rating > 3;""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None)]

#### `<=` : Less than or equal to

In [17]:
cursor.execute("""
SELECT * FROM employees WHERE salary <= 59000;""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None)]

#### `>=` : Greater than or equal to

In [18]:
cursor.execute("""
SELECT * FROM employees WHERE salary <= 60000;""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None)]

### **Logical Operators:**
#### `AND`: Used to combine multiple conditions where both must be true.

In [22]:
cursor.execute("SELECT * FROM employees WHERE department = 'Sales'""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None)]

In [23]:
cursor.execute("""
SELECT * FROM employees WHERE department = 'Sales' AND performance_rating >= 3""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None)]

In [24]:
cursor.execute("SELECT first_name, last_name FROM employees")
cursor.fetchall()

[('Jane', 'Smith'),
 ('Michael', 'Johnson'),
 ('Emily', 'Davis'),
 ('David', 'Wilson'),
 ('Linda', 'Martinez'),
 ('Robert', 'Anderson'),
 ('Patricia', 'Taylor'),
 ('Christopher', 'Thomas'),
 ('Jennifer', 'Lee'),
 ('James', 'White'),
 ('Barbara', 'Harris'),
 ('Daniel', 'Clark'),
 ('Nancy', 'Lewis'),
 ('Paul', 'Walker'),
 ('Karen', 'Hall'),
 ('Steven', 'Allen'),
 ('Elizabeth', 'Young'),
 ('George', 'King'),
 ('Mary', 'Wright'),
 ('Brian', 'Lopez'),
 ('Megan', 'Hill'),
 ('Anthony', 'Scott'),
 ('Deborah', 'Green'),
 ('Larry', 'Adams'),
 ('Sarah', 'Nelson'),
 ('Kenneth', 'Carter'),
 ('Betty', 'Mitchell'),
 ('Ronald', 'Perez'),
 ('Laura', 'Roberts')]

#### `OR`: Used to combine multiple conditions where at least one must be true.

In [25]:
cursor.execute("SELECT * FROM employees WHERE department = 'Operations' OR department = 'Marketing'")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None)]

In [26]:
cursor.execute("SELECT COUNT(*) FROM employees WHERE department = 'Operations' OR department = 'Marketing'")
cursor.fetchall()

[(10,)]

#### `NOT`: Used to negate a condition.

In [27]:
cursor.execute("SELECT * FROM employees WHERE NOT department = 'IT'")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3, None),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None)]

### **Special Operators:**
#### `BETWEEN`: Checks if a value falls within a specified range.

In [28]:
cursor.execute("""
SELECT * FROM employees WHERE salary BETWEEN 55000 and 60000""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2, None),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None)]

#### `IN`: Checks if a value belongs to a set of values.

In [33]:
cursor.execute("""SELECT * FROM employees
               WHERE department IN ('IT', 'Marketing', 'Operations')""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None, 'passed'),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None, 'failed'),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None, 'failed'),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None, 'passed'),
 (9,
  'Christopher',
  'Thomas',
  'Marketing',
  59000,
  '2024-05-02',
  2,
  None,
  'failed'),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None, 'passed'),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None, 'failed'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None, 'passed'),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None, 'passed'),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None, 'passed'),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None, 'failed'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None, 'passed'),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None, 'passed'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None, 'passed'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None, 'failed')]

#### `LIKE`: Used for pattern matching with wildcards.

In [34]:
# %string - ending substring
cursor.execute("""
SELECT first_name, last_name FROM employees WHERE last_name LIKE '%son';
""")
cursor.fetchall()

[('Michael', 'Johnson'),
 ('David', 'Wilson'),
 ('Robert', 'Anderson'),
 ('Sarah', 'Nelson')]

In [36]:
# string% - starting substring
cursor.execute("""
SELECT first_name, last_name FROM employees WHERE first_name LIKE 'ja%';
""")
cursor.fetchall()

[('Jane', 'Smith'), ('James', 'White')]

In [35]:
# Check for a certain month
cursor.execute("""SELECT * FROM employees WHERE hire_date LIKE '%-04-%'""") 
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None, 'passed'),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None, 'passed'),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None, 'failed'),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None, 'failed'),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None, 'passed'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None, 'passed')]

In [37]:
# %string% - contains the substring
cursor.execute("""SELECT * FROM employees WHERE hire_date LIKE '%-04-%'""") 
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None, 'passed'),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None, 'passed'),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None, 'failed'),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None, 'failed'),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None, 'passed'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None, 'passed')]

### **ORDER BY**

The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.

#### `ASC:` Ascending order (lowest to highest). (Default)

In [38]:
cursor.execute("""
SELECT * FROM employees
ORDER BY last_name ASC
""")
cursor.fetchall()

[(25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None, 'passed'),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None, 'passed'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None, 'passed'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None, 'passed'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None, 'passed'),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None, 'failed'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None, 'passed'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None, 'passed'),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None, 'failed'),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None, 'failed'),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None, 'passed'),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None, 'passed'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None, 'passed'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None, 'failed'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None, 'passed'),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None, 'passed'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None, 'passed'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None, 'failed'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None, 'passed'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None, 'failed'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3, None, 'passed'),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None, 'passed'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None, 'passed'),
 (9,
  'Christopher',
  'Thomas',
  'Marketing',
  59000,
  '2024-05-02',
  2,
  None,
  'failed'),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None, 'passed'),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None, 'passed'),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None, 'failed'),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None, 'passed'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None, 'failed')]

#### `DESC:` Descending order (highest to lowest).

In [40]:
cursor.execute("""
SELECT * FROM employees
ORDER BY salary DESC
""")
cursor.fetchall()

[(28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4, None, 'passed'),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2, None, 'failed'),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4, None, 'passed'),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5, None, 'passed'),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1, None, 'failed'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5, None, 'passed'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3, None, 'passed'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3, None, 'passed'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2, None, 'failed'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5, None, 'passed'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3, None, 'passed'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3, None, 'passed'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4, None, 'passed'),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2, None, 'failed'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2, None, 'failed'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5, None, 'passed'),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3, None, 'passed'),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5, None, 'passed'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4, None, 'passed'),
 (9,
  'Christopher',
  'Thomas',
  'Marketing',
  59000,
  '2024-05-02',
  2,
  None,
  'failed'),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1, None, 'failed'),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5, None, 'passed'),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3, None, 'passed'),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4, None, 'passed'),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3, None, 'passed'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2, None, 'failed'),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4, None, 'passed'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2, None, 'failed'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5, None, 'passed')]

Report: 
1. Employees at the IT Department have the highest salary followed by the Finance.
2. HR have the lowest salary.
3. Megan Hill and Barbara Harris have a high salary but poor performance.
4. Patricia Taylor from HR department have great performance but extremely low salary.

1. Larry Adams with a rating of 5 has the same salary as David Wilson with a poor rating of 1.

### **GROUP BY**

The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.

#### Grouping with `COUNT()`

In [41]:
cursor.execute("""
SELECT department, COUNT(*) FROM employees
               GROUP BY department
""")
cursor.fetchall()

[('Finance', 5),
 ('HR', 4),
 ('IT', 5),
 ('Marketing', 5),
 ('Operations', 5),
 ('Sales', 5)]

#### Grouping with `SUM()`

In [43]:
cursor.execute("""
SELECT department, SUM(salary) FROM employees
               GROUP BY department ORDER BY salary DESC
""")
cursor.fetchall()

[('IT', 350000),
 ('Finance', 324000),
 ('Operations', 291000),
 ('Sales', 310000),
 ('Marketing', 302000),
 ('HR', 214000)]

#### Grouping with `AVG()`

In [45]:
cursor.execute("""
SELECT department, AVG(salary) FROM employees
               GROUP BY department ORDER BY AVG(salary) DESC
""")
cursor.fetchall()

[('IT', 70000.0),
 ('Finance', 64800.0),
 ('Sales', 62000.0),
 ('Marketing', 60400.0),
 ('Operations', 58200.0),
 ('HR', 53500.0)]

#### Grouping with `MAX()` and `MIN()`

In [46]:
cursor.execute("""
SELECT department, MIN(salary), MAX(salary) FROM employees
               GROUP BY department ORDER BY MIN(salary) ASC;
""")
cursor.fetchall()

[('HR', 52000, 55000),
 ('Marketing', 55000, 65000),
 ('Operations', 56000, 62000),
 ('Sales', 60000, 64000),
 ('Finance', 62000, 67000),
 ('IT', 68000, 72000)]